app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hello!"], ["post_id", 1], ["created_at", "2016-10-17 23:12:54.854982"], ["updated_at", "2016-10-17 23:12:54.854982"]]
---
  def create
    @comment = @post.comments.build(comments_params)
    if @comment.save